Examples/Puisel Flow/PuiselFlowBase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          1600;
        startFace       281600;
    }
    outlet
    {
        type            patch;
        nFaces          1600;
        startFace       283200;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2400;
        startFace       284800;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2400;
        startFace       287200;
    }
    frontAndBack
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4800;
        startFace       289600;
    }
)

// ************************************************************************* //
